Results/Verifications/S2427/bottleneck-determination/point_select/threads-24/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=24 oltp_point_select --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-ty
pe=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 24
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 24 tps: 12960.87 qps: 12960.87 (r/w/o: 12960.87/0.00/0.00) lat (ms,95%): 4.49 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 24 tps: 12127.31 qps: 12127.31 (r/w/o: 12127.31/0.00/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 24 tps: 15357.31 qps: 15357.31 (r/w/o: 15357.31/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 24 tps: 15171.63 qps: 15171.63 (r/w/o: 15171.63/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 24 tps: 15181.58 qps: 15181.58 (r/w/o: 15181.58/0.00/0.00) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 24 tps: 15345.11 qps: 15345.11 (r/w/o: 15345.11/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 24 tps: 15407.77 qps: 15407.77 (r/w/o: 15407.77/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 24 tps: 15202.85 qps: 15202.85 (r/w/o: 15202.85/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 24 tps: 15215.83 qps: 15215.83 (r/w/o: 15215.83/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 24 tps: 15543.72 qps: 15543.72 (r/w/o: 15543.72/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1475216
        write:                           0
        other:                           0
        total:                           1475216
    transactions:                        1475216 (14750.98 per sec.)
    queries:                             1475216 (14750.98 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0060s
    total number of events:              1475216

Latency (ms):
         min:                                    0.67
         avg:                                    1.63
         max:                                  240.78
         95th percentile:                        3.68
         sum:                              2398616.12

Threads fairness:
    events (avg/stddev):           61467.3333/230.00
    execution time (avg/stddev):   99.9423/0.00


real    1m40.118s
user    0m22.323s
sys     0m39.624s